<?php
return [
    'required' => 'Обязательно для заполнения',
    'numeric' => 'Значение должно быть числовым',
    'email' => 'Не корректный email',
    'date_format' => 'Не корректная дата. Ожидаемый формат :values',
    'array' => 'Поле должно быть множественным',
    'string' => 'Поле должно быть строкой',
    'boolean' => 'Значение поля должно быть bool',
    'boolean_equals' => 'Значение должно быть :values',
    'date_range' => 'Значение не может быт меньше :min или больше :max',
    'between' => 'Значение не может быть меньше :min или больше :max',
    'max' => 'Количество символов должно быть меньше или равно :values',
    'min' => 'Количество символов должно быть больше или равно :values',
    'only_letters_ru' => 'Строка должна содержать только русские буквы',
    'only' => 'Значение должно быть :values'
];